# Data Science Pandas - Joins, Time Series & Rolling Statistics, SQL

## Tasks Today:

1) <b>Pandas</b> <br>
 &nbsp;&nbsp;&nbsp;&nbsp; a) Joins <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - merge() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Breaking Down the Inner Join <br>
 &nbsp;&nbsp;&nbsp;&nbsp; b) Outer Joins <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Use Case Example <br>
 &nbsp;&nbsp;&nbsp;&nbsp; c) Rolling Statistics and Time Series w/Pandas <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - read_csv() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - shift() <br>
 2) <b> SQL </b> <br>
      - Adding DataFrame to Database Table
      - Reading SQL Query Result into DataFrame

In [1]:
import pandas as pd
import numpy as np

### Joins <br>
<p>Very often you will have to combine data from several different sources to obtain the actual dataset you need for your exploration or modeling. Pandas draws heavily on SQL in its API design for joins, and if you are familiar with SQL joins, then Pandas will come naturally. Imagine you have two tables, one with customer name and gender, and the other with their purchases:</p>

In [2]:
# Generate some fake data
city_data = {
    1: 'Chicago',
    2: 'Boston',
    3: 'New York',
    4: 'San Francisco',
    5: 'Washington D.C.'
}

ages = np.random.randint(18,65, 100)
city = [ city_data[num] for num in np.random.randint(1,6,100)]
customer_id = np.arange(1000,1100)

<p>Let's assume we have a dataset containing the customer ID's cities, and ages for a set of customers. Suppose further, that we have a second table, containing some customer ID's, and a feedback survey rating from those customers. Suppose finally, that you as an analyst are asked the following question: What city tends to give the best feedback for our product? We'll need a join operation to get the answer.</p>

In [3]:
customer_demographics = pd.DataFrame.from_dict({
    'ages': ages,
    'city': city,
    'customer_id': customer_id
})

customer_demographics

    ages             city  customer_id
0     30         New York         1000
1     28  Washington D.C.         1001
2     25          Chicago         1002
3     53          Chicago         1003
4     59          Chicago         1004
..   ...              ...          ...
95    33           Boston         1095
96    56          Chicago         1096
97    61           Boston         1097
98    61         New York         1098
99    25    San Francisco         1099

[100 rows x 3 columns]

In [4]:
# Generate some other fake data
customer_id = np.random.randint(1000,1200, 100)
customer_rating = np.random.randint(1,11,100)

surveys = pd.DataFrame.from_dict({
    'customer_id': customer_id,
    'customer_rating': customer_rating
})

surveys.head()

   customer_id  customer_rating
0         1100                1
1         1038                4
2         1123                8
3         1078                3
4         1023                5

##### merge()

<p>We can zip the two dataframes up with an inner join, using the Pandas API as follows:</p>

In [5]:
merged_results = customer_demographics.merge(surveys,
                                             on = 'customer_id', 
                                             how = 'inner').drop_duplicates('customer_id').reset_index(drop=True)
merged_results.head()

   ages             city  customer_id  customer_rating
0    28  Washington D.C.         1001                6
1    25          Chicago         1002                3
2    59          Chicago         1004                5
3    36           Boston         1014               10
4    35         New York         1020                1

In [6]:
# Merging 2 DF's together, dropping duplicates from fake data and setting an index on the merged column (customer_id)
merged_2 = customer_demographics.merge(surveys, 
                                       on='customer_id',
                                       how='inner').drop_duplicates('customer_id').set_index(['customer_id'])
merged_2

             ages             city  customer_rating
customer_id
1001           28  Washington D.C.                6
1002           25          Chicago                3
1004           59          Chicago                5
1014           36           Boston               10
1020           35         New York                1
1021           27    San Francisco                6
1023           48         New York                5
1027           62  Washington D.C.                7
1029           18          Chicago                9
1036           24    San Francisco                1
1038           23           Boston                4
1042           50           Boston                3
1043           49          Chicago                5
1047           41         New York                1
1052           35    San Francisco               10
1056           26  Washington D.C.                2
1058           45          Chicago                1
1061           24  Washington D.C.                7
1062           57          Chicago                7
1063           45    San Francisco                8
1067           41  Washington D.C.                8
1073           45  Washington D.C.                4
1076           41    San Francisco               10
1078           51          Chicago                3
1079           55  Washington D.C.                2
1080           27         New York                4
1081           31          Chicago                4
1082           48         New York                9
1086           48  Washington D.C.                2
1087           60  Washington D.C.                1
1094           51          Chicago                2
1095           33           Boston                8
1097           61           Boston                5
1098           61         New York                1

**.join() method**

In [7]:
demo_join = customer_demographics.join(other = surveys.set_index('customer_id'), on = 'customer_id', how = 'inner')
demo_join

no_dups = demo_join.drop_duplicates('customer_id').reset_index()
no_dups

    index  ages             city  customer_id  customer_rating
0       1    28  Washington D.C.         1001                6
1       2    25          Chicago         1002                3
2       4    59          Chicago         1004                5
3      14    36           Boston         1014               10
4      20    35         New York         1020                1
5      21    27    San Francisco         1021                6
6      23    48         New York         1023                5
7      27    62  Washington D.C.         1027                7
8      29    18          Chicago         1029                9
9      36    24    San Francisco         1036                1
10     38    23           Boston         1038                4
11     42    50           Boston         1042                3
12     43    49          Chicago         1043                5
13     47    41         New York         1047                1
14     52    35    San Francisco         1052               10
15     56    26  Washington D.C.         1056                2
16     58    45          Chicago         1058                1
17     61    24  Washington D.C.         1061                7
18     62    57          Chicago         1062                7
19     63    45    San Francisco         1063                8
20     67    41  Washington D.C.         1067                8
21     73    45  Washington D.C.         1073                4
22     76    41    San Francisco         1076               10
23     78    51          Chicago         1078                3
24     79    55  Washington D.C.         1079                2
25     80    27         New York         1080                4
26     81    31          Chicago         1081                4
27     82    48         New York         1082                9
28     86    48  Washington D.C.         1086                2
29     87    60  Washington D.C.         1087                1
30     94    51          Chicago         1094                2
31     95    33           Boston         1095                8
32     97    61           Boston         1097                5
33     98    61         New York         1098                1

<p>Now it's a simple groupby operation to reveal the answer:</p>

In [8]:
city_age_ratings = no_dups.groupby('city', as_index=False).mean().round(decimals = 2)[['city', 'ages','customer_rating']]
city_age_ratings

              city   ages  customer_rating
0           Boston  40.60             6.00
1          Chicago  42.89             4.33
2         New York  43.33             3.50
3    San Francisco  34.40             7.00
4  Washington D.C.  43.22             4.33

But what if we didn't drop the customer_id duplicates...would we get the same city result??

In [9]:
city_ar_dups = demo_join.groupby('city', as_index = False).mean().round(decimals = 2)[['city','ages','customer_rating']]
city_ar_dups

              city   ages  customer_rating
0           Boston  39.33             5.33
1          Chicago  45.00             5.21
2         New York  43.33             3.50
3    San Francisco  34.50             7.00
4  Washington D.C.  43.00             4.83

What would be the total mean for the US customers?

In [10]:
no_dups['country'] = 'USA'
no_dups.groupby('country').mean().astype(int)[['ages','customer_rating']]

         ages  customer_rating
country
USA        41                4

##### Breaking Down the Inner Join <br>
<p>Let's take a closer look at the actual mechanics here however. There is some subtlety and nuance that is best understood by thinking of an inner join as two steps: a cartesian product, and then a filter. Observe the result of the following inner join:</p>

In [11]:
d = {
    'A':[1,2,3,4,2],
    'B': ['a','b','c','d','x']
}

df1 = pd.DataFrame.from_dict(d)
df1

   A  B
0  1  a
1  2  b
2  3  c
3  4  d
4  2  x

In [12]:
d2 = {
    'A': [1,2,6,2,2],
    'C': ['e','f','g','h','y']
}

df2 = pd.DataFrame.from_dict(d2)
df2

   A  C
0  1  e
1  2  f
2  6  g
3  2  h
4  2  y

In [13]:
df1.merge(df2, on = 'A', how='inner')

   A  B  C
0  1  a  e
1  2  b  f
2  2  b  h
3  2  b  y
4  2  x  f
5  2  x  h
6  2  x  y

<p>Somehow, we ended up with more rows in the result than either of the original tables! This is because we joined on a $\textit{non-unique index}$. The join starts by computing all the possible combinations of rows, and then filters them based on the condition. Because of the duplicates, multiple combinations of rows make it through!</p>

### Outer Joins <br>
<p>An $\textit{outer join}$ produces all of the rows from the left table, and joins whatever rows it can to the right table, filling anywhere it cant with NaN's or None values. Below is a brief example, and then we will discuss a possible use case for this type of join.</p>

In [14]:
df3 = pd.DataFrame.from_dict({
    'A':[1,2,3],
    'B': ['a','b','c']
})

df4 = pd.DataFrame.from_dict({
    'A': [1],
    'C': ['d']
})

In [15]:
df3

   A  B
0  1  a
1  2  b
2  3  c

In [16]:
df4

   A  C
0  1  d

In [17]:
df3.merge(df4, on='A', how = 'outer')

   A  B    C
0  1  a    d
1  2  b  NaN
2  3  c  NaN

In [18]:
# LEFT JOIN MERGE
df3.merge(df4, on='A', how='left')

   A  B    C
0  1  a    d
1  2  b  NaN
2  3  c  NaN

In [19]:
# RIGHT JOIN MERGE
df3.merge(df4, on='A', how='right')

   A  B  C
0  1  a  d

##### Use Case Example

<p>As an example use case, let's imagine we have again the demographics and survey response tables from above:</p>

In [20]:
customer_demographics

    ages             city  customer_id
0     30         New York         1000
1     28  Washington D.C.         1001
2     25          Chicago         1002
3     53          Chicago         1003
4     59          Chicago         1004
..   ...              ...          ...
95    33           Boston         1095
96    56          Chicago         1096
97    61           Boston         1097
98    61         New York         1098
99    25    San Francisco         1099

[100 rows x 3 columns]

In [21]:
surveys.head()

   customer_id  customer_rating
0         1100                1
1         1038                4
2         1123                8
3         1078                3
4         1023                5

<p>Now, you are asked as an analyst to compare the demographics of survey responders to the demographics of all your customers combined.</p>

In [25]:
demo_ratings_outer = customer_demographics.merge(surveys, on='customer_id', how='outer').drop_duplicates('customer_id').reset_index(drop=True)

demo_ratings_outer['customer_rating'] = demo_ratings_outer['customer_rating'].fillna('N/A')
demo_ratings_outer

     ages             city  customer_id customer_rating
0    30.0         New York         1000             N/A
1    28.0  Washington D.C.         1001               6
2    25.0          Chicago         1002               3
3    53.0          Chicago         1003             N/A
4    59.0          Chicago         1004               5
..    ...              ...          ...             ...
135   NaN              NaN         1121               4
136   NaN              NaN         1114              10
137   NaN              NaN         1162               6
138   NaN              NaN         1107               5
139   NaN              NaN         1136              10

[140 rows x 4 columns]

In [33]:
# Count all survey responders against the total number of customers we have 
# (Specifically the customers that haven't taken the survey yet)


# Getting the total number of survey respondents by filtering out n/a values
answered_surveys = demo_ratings_outer[demo_ratings_outer['customer_rating'] != 'N/A'].count()

total_surveys = answered_surveys.customer_rating

#getting the total number of customerid's associated with both tables regardless of survey/demo participation
total_customers = demo_ratings_outer.count().customer_id
total_customers


print(f'Our records show that only {((total_surveys/total_customers)*100).round()}% of our customers have completed this survey!')

Our records show that only 53.0% of our customers have completed this survey!

In [38]:
# average age of people that answered the survey
new_survey_df = demo_ratings_outer[demo_ratings_outer['customer_rating'] != 'N/A'].reset_index()
# new_survey_df['ages'] = new_survey_df['ages'].fillna('N/A')

# new_survey_df[new_survey_df['ages'] != 'N/A'].mean()['ages']
new_survey_df['ages'].mean()

41.470588235294116

In [41]:
# find the average age of people that did not answer the survey
survey_non_answer = demo_ratings_outer[demo_ratings_outer['customer_rating'] == 'N/A']['ages'].mean()

survey_non_answer

40.93939393939394

### Rolling Statistics and Time Series with Pandas

##### read_csv()

In [42]:
weather = pd.read_csv('../files/chiweather.csv', sep = ';')

In [43]:
weather

,Year,Month,Day,Hour,Minute,Temperature [2 m above gnd],Total Precipitation [sfc],Wind speed [10 m above gnd],Wind direction [10 m above gnd]
0,2017,11,25,0,0,51.85,0.0,17.31,327.13
1,2017,11,25,1,0,49.14,0.0,20.53,330.64
2,2017,11,25,2,0,46.42,0.0,21.41,327.80
3,2017,11,25,3,0,44.13,0.0,21.79,324.19
4,2017,11,25,4,0,42.22,0.0,21.03,321.91
...,...,...,...,...,...,...,...,...,...
187,2017,12,2,19,0,50.36,0.0,6.27,235.18
188,2017,12,2,20,0,49.33,0.0,6.50,243.43
189,2017,12,2,21,0,48.29,0.0,6.37,251.57
190,2017,12,2,22,0,47.16,0.0,6.11,261.57
191,2017,12,2,23,0,45.75,0.0,5.82,270.00

In [44]:
weather_update = weather.groupby(['Year','Month','Day']).mean()

In [46]:
weather_update

                Hour  Minute  Temperature  [2 m above gnd]  \
Year Month Day
2017 11    25   11.5     0.0                     41.208750
           26   11.5     0.0                     38.298333
           27   11.5     0.0                     45.611250
           28   11.5     0.0                     48.497500
           29   11.5     0.0                     40.122917
           30   11.5     0.0                     43.618750
     12    1    11.5     0.0                     41.860417
           2    11.5     0.0                     45.324167

                Total Precipitation  [sfc]  Wind speed  [10 m above gnd]  \
Year Month Day
2017 11    25                     0.000000                     17.939583
           26                     0.000000                     11.435417
           27                     0.000000                     11.082500
           28                     0.000000                     17.418750
           29                     0.020833                     13.107083
           30                     0.033333                     14.343333
     12    1                      0.000000                      6.845000
           2                      0.000000                      8.934167

                Wind direction  [10 m above gnd]
Year Month Day
2017 11    25                         325.761667
           26                         258.533750
           27                         188.377083
           28                         244.673333
           29                         167.510000
           30                         276.060000
     12    1                          223.459583
           2                          218.252500

##### shift() <br>
<p>Shift index by desired number of periods with an optional time freq</p>

In [47]:
# Print all keys for easier use
print(weather_update.keys())

Index(['Hour', 'Minute', 'Temperature  [2 m above gnd]',
       'Total Precipitation  [sfc]', 'Wind speed  [10 m above gnd]',
       'Wind direction  [10 m above gnd]'],
      dtype='object')

In [48]:
#create a new column to refelct the previous days temperatures....
# We can do this by making a copy of temps, appending it onto our dataFrame, and shifting all values down
# by one idex
weather_update['last_temp'] = weather_update['Temperature  [2 m above gnd]'].shift(1)
weather_update

                Hour  Minute  Temperature  [2 m above gnd]  \
Year Month Day
2017 11    25   11.5     0.0                     41.208750
           26   11.5     0.0                     38.298333
           27   11.5     0.0                     45.611250
           28   11.5     0.0                     48.497500
           29   11.5     0.0                     40.122917
           30   11.5     0.0                     43.618750
     12    1    11.5     0.0                     41.860417
           2    11.5     0.0                     45.324167

                Total Precipitation  [sfc]  Wind speed  [10 m above gnd]  \
Year Month Day
2017 11    25                     0.000000                     17.939583
           26                     0.000000                     11.435417
           27                     0.000000                     11.082500
           28                     0.000000                     17.418750
           29                     0.020833                     13.107083
           30                     0.033333                     14.343333
     12    1                      0.000000                      6.845000
           2                      0.000000                      8.934167

                Wind direction  [10 m above gnd]  last_temp
Year Month Day
2017 11    25                         325.761667        NaN
           26                         258.533750  41.208750
           27                         188.377083  38.298333
           28                         244.673333  45.611250
           29                         167.510000  48.497500
           30                         276.060000  40.122917
     12    1                          223.459583  43.618750
           2                          218.252500  41.860417

In [49]:
# create a new column that takes the difference in temperature from the previous day as an absolute value
weather_update['difference'] = abs(weather_update['Temperature  [2 m above gnd]'] - weather_update['last_temp'])
weather_update

                Hour  Minute  Temperature  [2 m above gnd]  \
Year Month Day
2017 11    25   11.5     0.0                     41.208750
           26   11.5     0.0                     38.298333
           27   11.5     0.0                     45.611250
           28   11.5     0.0                     48.497500
           29   11.5     0.0                     40.122917
           30   11.5     0.0                     43.618750
     12    1    11.5     0.0                     41.860417
           2    11.5     0.0                     45.324167

                Total Precipitation  [sfc]  Wind speed  [10 m above gnd]  \
Year Month Day
2017 11    25                     0.000000                     17.939583
           26                     0.000000                     11.435417
           27                     0.000000                     11.082500
           28                     0.000000                     17.418750
           29                     0.020833                     13.107083
           30                     0.033333                     14.343333
     12    1                      0.000000                      6.845000
           2                      0.000000                      8.934167

                Wind direction  [10 m above gnd]  last_temp  difference
Year Month Day
2017 11    25                         325.761667        NaN         NaN
           26                         258.533750  41.208750    2.910417
           27                         188.377083  38.298333    7.312917
           28                         244.673333  45.611250    2.886250
           29                         167.510000  48.497500    8.374583
           30                         276.060000  40.122917    3.495833
     12    1                          223.459583  43.618750    1.758333
           2                          218.252500  41.860417    3.463750

In [51]:
from statistics import mean
#Adding in temp from 2 days ago to calcultae rolling 3 day avg
weather_update['last_temp_2'] = weather_update['Temperature  [2 m above gnd]'].shift(2)


# caluclating average temp over last 3 days
weather_update['r_3d_average'] = (weather_update['Temperature  [2 m above gnd]'] + weather_update['last_temp'] + weather_update['last_temp_2'])/3
weather_update

                Hour  Minute  Temperature  [2 m above gnd]  \
Year Month Day
2017 11    25   11.5     0.0                     41.208750
           26   11.5     0.0                     38.298333
           27   11.5     0.0                     45.611250
           28   11.5     0.0                     48.497500
           29   11.5     0.0                     40.122917
           30   11.5     0.0                     43.618750
     12    1    11.5     0.0                     41.860417
           2    11.5     0.0                     45.324167

                Total Precipitation  [sfc]  Wind speed  [10 m above gnd]  \
Year Month Day
2017 11    25                     0.000000                     17.939583
           26                     0.000000                     11.435417
           27                     0.000000                     11.082500
           28                     0.000000                     17.418750
           29                     0.020833                     13.107083
           30                     0.033333                     14.343333
     12    1                      0.000000                      6.845000
           2                      0.000000                      8.934167

                Wind direction  [10 m above gnd]  last_temp  difference  \
Year Month Day
2017 11    25                         325.761667        NaN         NaN
           26                         258.533750  41.208750    2.910417
           27                         188.377083  38.298333    7.312917
           28                         244.673333  45.611250    2.886250
           29                         167.510000  48.497500    8.374583
           30                         276.060000  40.122917    3.495833
     12    1                          223.459583  43.618750    1.758333
           2                          218.252500  41.860417    3.463750

                last_temp_2  r_3d_average
Year Month Day
2017 11    25           NaN           NaN
           26           NaN           NaN
           27     41.208750     41.706111
           28     38.298333     44.135694
           29     45.611250     44.743889
           30     48.497500     44.079722
     12    1      40.122917     41.867361
           2      43.618750     43.601111

In [52]:
# Pip install for both psycopg2 and SQLAlchemy
import sys
!{sys.executable} -m pip install psycopg2-binary SQLAlchemy

Requirement already satisfied: psycopg2-binary in /opt/anaconda3/lib/python3.7/site-packages (2.8.6)
Requirement already satisfied: SQLAlchemy in /opt/anaconda3/lib/python3.7/site-packages (1.3.23)

In [54]:
# databaselanguage(postgresql)://user:password@url:port/database_name
connection = 'postgresql://postgres:Griffen16!@127.0.0.1:5432/chicago_weather_operators'

weather_update['last_temp'] = weather_update['last_temp'].fillna(float(0))
weather_update['difference'] = weather_update['difference'].fillna(float(0))
weather_update

                Hour  Minute  Temperature  [2 m above gnd]  \
Year Month Day
2017 11    25   11.5     0.0                     41.208750
           26   11.5     0.0                     38.298333
           27   11.5     0.0                     45.611250
           28   11.5     0.0                     48.497500
           29   11.5     0.0                     40.122917
           30   11.5     0.0                     43.618750
     12    1    11.5     0.0                     41.860417
           2    11.5     0.0                     45.324167

                Total Precipitation  [sfc]  Wind speed  [10 m above gnd]  \
Year Month Day
2017 11    25                     0.000000                     17.939583
           26                     0.000000                     11.435417
           27                     0.000000                     11.082500
           28                     0.000000                     17.418750
           29                     0.020833                     13.107083
           30                     0.033333                     14.343333
     12    1                      0.000000                      6.845000
           2                      0.000000                      8.934167

                Wind direction  [10 m above gnd]  last_temp  difference  \
Year Month Day
2017 11    25                         325.761667   0.000000    0.000000
           26                         258.533750  41.208750    2.910417
           27                         188.377083  38.298333    7.312917
           28                         244.673333  45.611250    2.886250
           29                         167.510000  48.497500    8.374583
           30                         276.060000  40.122917    3.495833
     12    1                          223.459583  43.618750    1.758333
           2                          218.252500  41.860417    3.463750

                last_temp_2  r_3d_average
Year Month Day
2017 11    25           NaN           NaN
           26           NaN           NaN
           27     41.208750     41.706111
           28     38.298333     44.135694
           29     45.611250     44.743889
           30     48.497500     44.079722
     12    1      40.122917     41.867361
           2      43.618750     43.601111

In [55]:

new = weather_update.drop(labels='last_temp_2',axis=1)
final_weather = new.drop(labels='r_3d_average', axis=1)
final_weather

                Hour  Minute  Temperature  [2 m above gnd]  \
Year Month Day
2017 11    25   11.5     0.0                     41.208750
           26   11.5     0.0                     38.298333
           27   11.5     0.0                     45.611250
           28   11.5     0.0                     48.497500
           29   11.5     0.0                     40.122917
           30   11.5     0.0                     43.618750
     12    1    11.5     0.0                     41.860417
           2    11.5     0.0                     45.324167

                Total Precipitation  [sfc]  Wind speed  [10 m above gnd]  \
Year Month Day
2017 11    25                     0.000000                     17.939583
           26                     0.000000                     11.435417
           27                     0.000000                     11.082500
           28                     0.000000                     17.418750
           29                     0.020833                     13.107083
           30                     0.033333                     14.343333
     12    1                      0.000000                      6.845000
           2                      0.000000                      8.934167

                Wind direction  [10 m above gnd]  last_temp  difference
Year Month Day
2017 11    25                         325.761667   0.000000    0.000000
           26                         258.533750  41.208750    2.910417
           27                         188.377083  38.298333    7.312917
           28                         244.673333  45.611250    2.886250
           29                         167.510000  48.497500    8.374583
           30                         276.060000  40.122917    3.495833
     12    1                          223.459583  43.618750    1.758333
           2                          218.252500  41.860417    3.463750

In [56]:
# Writing a DataFrame to PostGreSQL database 
# from sqlalchemy.types import Integer, Text,String,DateTime,Float
from sqlalchemy.types import Integer, Text, String, DateTime, Float

final_weather.to_sql('chicago-weather', index=False, con = connection, if_exists = 'append',
                     schema = 'public', chunksize = 500, dtype = {
                         'year': String,
                         'month': String,
                         'day': String,
                         'minute': String,
                         'Temperature  [2 m above gnd]': Float,
                         'Total Precipitation  [sfc]': Float ,
                         'Wind speed  [10 m above gnd]': Float ,
                         'Wind direction  [10 m above gnd]': Float ,
                         'last_temp': Float,
                         'difference': Float
                     })

In [57]:
# READING SQL DATA
chicago_weather_sql = pd.read_sql_table('chicago-weather', con = connection)

chicago_weather_sql

,Hour,Minute,Temperature [2 m above gnd],Total Precipitation [sfc],Wind speed [10 m above gnd],Wind direction [10 m above gnd],last_temp,difference
0,11.5,0.0,41.208750,0.000000,17.939583,325.761667,0.000000,0.000000
1,11.5,0.0,38.298333,0.000000,11.435417,258.533750,41.208750,2.910417
2,11.5,0.0,45.611250,0.000000,11.082500,188.377083,38.298333,7.312917
3,11.5,0.0,48.497500,0.000000,17.418750,244.673333,45.611250,2.886250
4,11.5,0.0,40.122917,0.020833,13.107083,167.510000,48.497500,8.374583
5,11.5,0.0,43.618750,0.033333,14.343333,276.060000,40.122917,3.495833
6,11.5,0.0,41.860417,0.000000,6.845000,223.459583,43.618750,1.758333
7,11.5,0.0,45.324167,0.000000,8.934167,218.252500,41.860417,3.463750

In [58]:
connection = 'postgresql://postgres:Griffen16!@127.0.0.1:5432/dvd-rental-operators'
dvd_rental = pd.read_sql_table('customer', con=connection)
dvd_rental

,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active
0,524,1,Jared,Ely,jared.ely@sakilacustomer.org,530,True,2006-02-14,2013-05-26 14:49:45.738,1
1,1,1,Mary,Smith,mary.smith@sakilacustomer.org,5,True,2006-02-14,2013-05-26 14:49:45.738,1
2,2,1,Patricia,Johnson,patricia.johnson@sakilacustomer.org,6,True,2006-02-14,2013-05-26 14:49:45.738,1
3,3,1,Linda,Williams,linda.williams@sakilacustomer.org,7,True,2006-02-14,2013-05-26 14:49:45.738,1
4,4,2,Barbara,Jones,barbara.jones@sakilacustomer.org,8,True,2006-02-14,2013-05-26 14:49:45.738,1
...,...,...,...,...,...,...,...,...,...,...
594,595,1,Terrence,Gunderson,terrence.gunderson@sakilacustomer.org,601,True,2006-02-14,2013-05-26 14:49:45.738,1
595,596,1,Enrique,Forsythe,enrique.forsythe@sakilacustomer.org,602,True,2006-02-14,2013-05-26 14:49:45.738,1
596,597,1,Freddie,Duggan,freddie.duggan@sakilacustomer.org,603,True,2006-02-14,2013-05-26 14:49:45.738,1
597,598,1,Wade,Delvalle,wade.delvalle@sakilacustomer.org,604,True,2006-02-14,2013-05-26 14:49:45.738,1
598,599,2,Austin,Cintron,austin.cintron@sakilacustomer.org,605,True,2006-02-14,2013-05-26 14:49:45.738,1